---
type: EnergyAnalysisMaterial
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 8
tags: [revit-api, class]
---

# EnergyAnalysisMaterial

`Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Density | 2024 | `public double Density { get ; }` |
| Property | Description | 2024 | `public string Description { get ; }` |
| Property | MaterialName | 2024 | `public string MaterialName { get ; }` |
| Property | Parameter | — | `` |
| Property | SpecificHeatCapacity | 2024 | `public double SpecificHeatCapacity { get ; }` |
| Property | ThermalConductivity | 2024 | `public double ThermalConductivity { get ; }` |
| Property | ThermalResistance | 2024 | `public double ThermalResistance { get ; }` |
| Property | Thickness | 2024 | `public double Thickness { get ; }` |